20230819051305-os_process_management.org
:PROPERTIES:
:ID:       3cd866d9-d8c5-4501-b58b-bcc122b58cd8
:END:
#+title: Process Management
#+filetags: :OS:

The [[id:cba22c0a-759f-4b3a-9ee4-25663f8eb434][Kernel]]:
- Schedule time for the [[id:434b40ba-6fee-45ee-95e0-f8b79f751cdd][CPU]] to execute the instructions in the process ([[id:183cb220-3594-4c2f-badd-e1cda63de79e][Time Slice]])
- Creates [[id:2bc74ef5-d9b1-4286-ab74-bc061c6a1704][processes]]
- Efficiently schedules them
- Manages how [[id:2bc74ef5-d9b1-4286-ab74-bc061c6a1704][processes]] are terminated
- Reallocation of used resources to new [[id:2bc74ef5-d9b1-4286-ab74-bc061c6a1704][processes]]

[[id:25082536-c906-4344-a87e-7f1777401b82][Signal]]
[[id:70986438-dd4b-48d1-91c5-329b72c22c96][Process Resource Management]]

* [[id:45bb23df-e29d-46dc-b704-f17cf26af1d7][Windows]]
** Task manager Utility
** =Get-Process= Powershell
** =tasklist= CMD
** [[id:45de0c85-9cef-4a16-bf07-d5f34e2acba8][Process Exlporer]]

* [[id:5c6ee0bf-4232-4ea7-8117-cfd39937a099][Linux]]
** =ps= Command
Status:
- =R= Running
- =T= Stopped
- =S= interruptible Sleep

** =ls -l /proc= Command

