20230819051305-os_process_management.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-03 Tue 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Process Management</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Process Management</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga140075">1. Windows</a>
<ul>
<li><a href="#org333ab74">1.1. Task manager Utility</a></li>
<li><a href="#org9bae645">1.2. <code>Get-Process</code> Powershell</a></li>
<li><a href="#orgdb66e6b">1.3. <code>tasklist</code> CMD</a></li>
<li><a href="#org95def9a">1.4. Process Exlporer</a></li>
</ul>
</li>
<li><a href="#org04bbcd3">2. Linux</a>
<ul>
<li><a href="#orgab07d19">2.1. <code>ps</code> Command</a></li>
<li><a href="#org41f80dc">2.2. <code>ls -l /proc</code> Command</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The <a href="20230819051737-kernel.html#ID-cba22c0a-759f-4b3a-9ee4-25663f8eb434">Kernel</a>:
</p>
<ul class="org-ul">
<li>Schedule time for the <a href="20230818061710-central_processing_unit_cpu.html#ID-434b40ba-6fee-45ee-95e0-f8b79f751cdd">CPU</a> to execute the instructions in the process (<a href="20230819051430-time_slice.html#ID-183cb220-3594-4c2f-badd-e1cda63de79e">Time Slice</a>)</li>
<li>Creates <a href="20230819051525-os_process.html#ID-2bc74ef5-d9b1-4286-ab74-bc061c6a1704">processes</a></li>
<li>Efficiently schedules them</li>
<li>Manages how <a href="20230819051525-os_process.html#ID-2bc74ef5-d9b1-4286-ab74-bc061c6a1704">processes</a> are terminated</li>
<li>Reallocation of used resources to new <a href="20230819051525-os_process.html#ID-2bc74ef5-d9b1-4286-ab74-bc061c6a1704">processes</a></li>
</ul>

<p>
<a href="20230825072146-signal.html#ID-25082536-c906-4344-a87e-7f1777401b82">Signal</a>
<a href="20230825080338-process_resource_management.html#ID-70986438-dd4b-48d1-91c5-329b72c22c96">Process Resource Management</a>
</p>

<div id="outline-container-orga140075" class="outline-2">
<h2 id="orga140075"><span class="section-number-2">1.</span> <a href="20230819062442-windows.html#ID-45bb23df-e29d-46dc-b704-f17cf26af1d7">Windows</a></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org333ab74" class="outline-3">
<h3 id="org333ab74"><span class="section-number-3">1.1.</span> Task manager Utility</h3>
</div>
<div id="outline-container-org9bae645" class="outline-3">
<h3 id="org9bae645"><span class="section-number-3">1.2.</span> <code>Get-Process</code> Powershell</h3>
</div>
<div id="outline-container-orgdb66e6b" class="outline-3">
<h3 id="orgdb66e6b"><span class="section-number-3">1.3.</span> <code>tasklist</code> CMD</h3>
</div>
<div id="outline-container-org95def9a" class="outline-3">
<h3 id="org95def9a"><span class="section-number-3">1.4.</span> <a href="20230825072425-process_exlporer.html#ID-45de0c85-9cef-4a16-bf07-d5f34e2acba8">Process Exlporer</a></h3>
</div>
</div>

<div id="outline-container-org04bbcd3" class="outline-2">
<h2 id="org04bbcd3"><span class="section-number-2">2.</span> <a href="20230820050746-linux.html#ID-5c6ee0bf-4232-4ea7-8117-cfd39937a099">Linux</a></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgab07d19" class="outline-3">
<h3 id="orgab07d19"><span class="section-number-3">2.1.</span> <code>ps</code> Command</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Status:
</p>
<ul class="org-ul">
<li><code>R</code> Running</li>
<li><code>T</code> Stopped</li>
<li><code>S</code> interruptible Sleep</li>
</ul>
</div>
</div>

<div id="outline-container-org41f80dc" class="outline-3">
<h3 id="org41f80dc"><span class="section-number-3">2.2.</span> <code>ls -l /proc</code> Command</h3>
</div>
</div>
</div>
</body>
</html>
